Revit 2027 API
ConnectorElement.ChangeHostReference Method
Overload List
Name | Description
ChangeHostReference(Reference) |  Changes the connector host reference to a new planar face.
ChangeHostReference(Reference, Edge) |  Changes the connector host reference to a new planar face and a new edge loop.
Top
See Also
Reference
ConnectorElement Class
Autodesk.Revit.DB Namespace